ycsb/logs/TCP_16_async_th_28/workloadf.log
Select TCP mode
Select TCP mode
Select TCP mode
[...]
[OVERALL], RunTime(ms), 21552
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4639.940608760208
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 9
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.04175946547884187
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 9
[TOTAL_GC_TIME_%], Time(%), 0.04175946547884187
[READ], Operations, 100000
[READ], AverageLatency(us), 97.33582
[READ], MinLatency(us), 61
[READ], MaxLatency(us), 10239
[READ], 95thPercentileLatency(us), 128
[READ], 99thPercentileLatency(us), 169
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50136
[READ-MODIFY-WRITE], AverageLatency(us), 328.73330540928674
[READ-MODIFY-WRITE], MinLatency(us), 200
[READ-MODIFY-WRITE], MaxLatency(us), 13447
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 492
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 665
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 827.0
[CLEANUP], MinLatency(us), 827
[CLEANUP], MaxLatency(us), 827
[CLEANUP], 95thPercentileLatency(us), 827
[CLEANUP], 99thPercentileLatency(us), 827
[UPDATE], Operations, 50136
[UPDATE], AverageLatency(us), 230.03091590872825
[UPDATE], MinLatency(us), 130
[UPDATE], MaxLatency(us), 13327
[UPDATE], 95thPercentileLatency(us), 380
[UPDATE], 99thPercentileLatency(us), 542
[UPDATE], Return=OK, 50136
[OVERALL], RunTime(ms), 21750
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4597.701149425287
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 20
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.09195402298850575
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 20
[TOTAL_GC_TIME_%], Time(%), 0.09195402298850575
[READ], Operations, 100000
[READ], AverageLatency(us), 99.42423
[READ], MinLatency(us), 62
[READ], MaxLatency(us), 216191
[READ], 95thPercentileLatency(us), 128
[READ], 99thPercentileLatency(us), 167
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49983
[READ-MODIFY-WRITE], AverageLatency(us), 333.0893103655243
[READ-MODIFY-WRITE], MinLatency(us), 206
[READ-MODIFY-WRITE], MaxLatency(us), 217599
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 499
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 675
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 918.0
[CLEANUP], MinLatency(us), 918
[CLEANUP], MaxLatency(us), 918
[CLEANUP], 95thPercentileLatency(us), 918
[CLEANUP], 99thPercentileLatency(us), 918
[UPDATE], Operations, 49983
[UPDATE], AverageLatency(us), 230.1162595282396
[UPDATE], MinLatency(us), 131
[UPDATE], MaxLatency(us), 21087
[UPDATE], 95thPercentileLatency(us), 382
[UPDATE], 99thPercentileLatency(us), 543
[UPDATE], Return=OK, 49983
[OVERALL], RunTime(ms), 21743
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4599.181345720462
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 12
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.05519017614864554
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 0.05519017614864554
[READ], Operations, 100000
[READ], AverageLatency(us), 98.43013
[READ], MinLatency(us), 65
[READ], MaxLatency(us), 13095
[READ], 95thPercentileLatency(us), 129
[READ], 99thPercentileLatency(us), 165
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50056
[READ-MODIFY-WRITE], AverageLatency(us), 331.7729742688189
[READ-MODIFY-WRITE], MinLatency(us), 209
[READ-MODIFY-WRITE], MaxLatency(us), 13311
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 498
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 664
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 712.0
[CLEANUP], MinLatency(us), 712
[CLEANUP], MaxLatency(us), 712
[CLEANUP], 95thPercentileLatency(us), 712
[CLEANUP], 99thPercentileLatency(us), 712
[UPDATE], Operations, 50056
[UPDATE], AverageLatency(us), 232.0074316765223
[UPDATE], MinLatency(us), 134
[UPDATE], MaxLatency(us), 12535
[UPDATE], 95thPercentileLatency(us), 381
[UPDATE], 99thPercentileLatency(us), 540
[UPDATE], Return=OK, 50056
[OVERALL], RunTime(ms), 21967
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4552.28296990941
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 13
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.059179678608822325
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 13
[TOTAL_GC_TIME_%], Time(%), 0.059179678608822325
[READ], Operations, 100000
[READ], AverageLatency(us), 99.73024
[READ], MinLatency(us), 64
[READ], MaxLatency(us), 62079
[READ], 95thPercentileLatency(us), 131
[READ], 99thPercentileLatency(us), 168
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49874
[READ-MODIFY-WRITE], AverageLatency(us), 336.66631912419297
[READ-MODIFY-WRITE], MinLatency(us), 205
[READ-MODIFY-WRITE], MaxLatency(us), 63263
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 508
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 679
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 761.0
[CLEANUP], MinLatency(us), 761
[CLEANUP], MaxLatency(us), 761
[CLEANUP], 95thPercentileLatency(us), 761
[CLEANUP], 99thPercentileLatency(us), 761
[UPDATE], Operations, 49874
[UPDATE], AverageLatency(us), 234.61795725227574
[UPDATE], MinLatency(us), 132
[UPDATE], MaxLatency(us), 9463
[UPDATE], 95thPercentileLatency(us), 389
[UPDATE], 99thPercentileLatency(us), 549
[UPDATE], Return=OK, 49874
[OVERALL], RunTime(ms), 22047
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4535.764503106999
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 13
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.05896493854039099
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 13
[TOTAL_GC_TIME_%], Time(%), 0.05896493854039099
[READ], Operations, 100000
[READ], AverageLatency(us), 100.81976
[READ], MinLatency(us), 65
[READ], MaxLatency(us), 155007
[READ], 95thPercentileLatency(us), 129
[READ], 99thPercentileLatency(us), 168
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50051
[READ-MODIFY-WRITE], AverageLatency(us), 336.87668578050386
[READ-MODIFY-WRITE], MinLatency(us), 216
[READ-MODIFY-WRITE], MaxLatency(us), 156543
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 497
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 665
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 888.0
[CLEANUP], MinLatency(us), 888
[CLEANUP], MaxLatency(us), 888
[CLEANUP], 95thPercentileLatency(us), 888
[CLEANUP], 99thPercentileLatency(us), 888
[UPDATE], Operations, 50051
[UPDATE], AverageLatency(us), 233.12946794269845
[UPDATE], MinLatency(us), 140
[UPDATE], MaxLatency(us), 14199
[UPDATE], 95thPercentileLatency(us), 382
[UPDATE], 99thPercentileLatency(us), 534
[UPDATE], Return=OK, 50051
[OVERALL], RunTime(ms), 22202
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4504.098729844158
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 18
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.08107377713719485
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 18
[TOTAL_GC_TIME_%], Time(%), 0.08107377713719485
[READ], Operations, 100000
[READ], AverageLatency(us), 100.76512
[READ], MinLatency(us), 65
[READ], MaxLatency(us), 8943
[READ], 95thPercentileLatency(us), 132
[READ], 99thPercentileLatency(us), 169
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50063
[READ-MODIFY-WRITE], AverageLatency(us), 338.49981023909874
[READ-MODIFY-WRITE], MinLatency(us), 215
[READ-MODIFY-WRITE], MaxLatency(us), 19231
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 508
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 684
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 870.0
[CLEANUP], MinLatency(us), 870
[CLEANUP], MaxLatency(us), 870
[CLEANUP], 95thPercentileLatency(us), 870
[CLEANUP], 99thPercentileLatency(us), 870
[UPDATE], Operations, 50063
[UPDATE], AverageLatency(us), 236.44479955256378
[UPDATE], MinLatency(us), 139
[UPDATE], MaxLatency(us), 18623
[UPDATE], 95thPercentileLatency(us), 389
[UPDATE], 99thPercentileLatency(us), 547
[UPDATE], Return=OK, 50063
[OVERALL], RunTime(ms), 22256
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4493.170381020848
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 12
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.053918044572250176
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 0.053918044572250176
[READ], Operations, 100000
[READ], AverageLatency(us), 101.50284
[READ], MinLatency(us), 70
[READ], MaxLatency(us), 12927
[READ], 95thPercentileLatency(us), 132
[READ], 99thPercentileLatency(us), 169
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50030
[READ-MODIFY-WRITE], AverageLatency(us), 339.09336398161105
[READ-MODIFY-WRITE], MinLatency(us), 223
[READ-MODIFY-WRITE], MaxLatency(us), 13479
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 504
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 674
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 625.0
[CLEANUP], MinLatency(us), 625
[CLEANUP], MaxLatency(us), 625
[CLEANUP], 95thPercentileLatency(us), 625
[CLEANUP], 99thPercentileLatency(us), 625
[UPDATE], Operations, 50030
[UPDATE], AverageLatency(us), 236.328802718369
[UPDATE], MinLatency(us), 144
[UPDATE], MaxLatency(us), 12823
[UPDATE], 95thPercentileLatency(us), 386
[UPDATE], 99thPercentileLatency(us), 544
[UPDATE], Return=OK, 50030
[OVERALL], RunTime(ms), 22575
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4429.678848283499
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 11
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.04872646733111849
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 11
[TOTAL_GC_TIME_%], Time(%), 0.04872646733111849
[READ], Operations, 100000
[READ], AverageLatency(us), 102.77147
[READ], MinLatency(us), 64
[READ], MaxLatency(us), 155007
[READ], 95thPercentileLatency(us), 134
[READ], 99thPercentileLatency(us), 172
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50221
[READ-MODIFY-WRITE], AverageLatency(us), 344.81284721530835
[READ-MODIFY-WRITE], MinLatency(us), 212
[READ-MODIFY-WRITE], MaxLatency(us), 156159
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 518
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 697
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 826.0
[CLEANUP], MinLatency(us), 826
[CLEANUP], MaxLatency(us), 826
[CLEANUP], 95thPercentileLatency(us), 826
[CLEANUP], 99thPercentileLatency(us), 826
[UPDATE], Operations, 50221
[UPDATE], AverageLatency(us), 239.03998327392924
[UPDATE], MinLatency(us), 139
[UPDATE], MaxLatency(us), 62015
[UPDATE], 95thPercentileLatency(us), 394
[UPDATE], 99thPercentileLatency(us), 557
[UPDATE], Return=OK, 50221
[OVERALL], RunTime(ms), 22638
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4417.351356126866
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 9
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0397561622051418
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 9
[TOTAL_GC_TIME_%], Time(%), 0.0397561622051418
[READ], Operations, 100000
[READ], AverageLatency(us), 108.47055
[READ], MinLatency(us), 68
[READ], MaxLatency(us), 698879
[READ], 95thPercentileLatency(us), 130
[READ], 99thPercentileLatency(us), 167
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49867
[READ-MODIFY-WRITE], AverageLatency(us), 332.34920889566246
[READ-MODIFY-WRITE], MinLatency(us), 221
[READ-MODIFY-WRITE], MaxLatency(us), 13791
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 482
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 638
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 745.0
[CLEANUP], MinLatency(us), 745
[CLEANUP], MaxLatency(us), 745
[CLEANUP], 95thPercentileLatency(us), 745
[CLEANUP], 99thPercentileLatency(us), 745
[UPDATE], Operations, 49867
[UPDATE], AverageLatency(us), 230.4886798885034
[UPDATE], MinLatency(us), 143
[UPDATE], MaxLatency(us), 13095
[UPDATE], 95thPercentileLatency(us), 367
[UPDATE], 99thPercentileLatency(us), 511
[UPDATE], Return=OK, 49867
[OVERALL], RunTime(ms), 22784
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4389.044943820225
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 12
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.05266853932584269
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 0.05266853932584269
[READ], Operations, 100000
[READ], AverageLatency(us), 104.38903
[READ], MinLatency(us), 67
[READ], MaxLatency(us), 231551
[READ], 95thPercentileLatency(us), 132
[READ], 99thPercentileLatency(us), 167
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50132
[READ-MODIFY-WRITE], AverageLatency(us), 348.7087688502354
[READ-MODIFY-WRITE], MinLatency(us), 216
[READ-MODIFY-WRITE], MaxLatency(us), 233215
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 512
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 684
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 960.0
[CLEANUP], MinLatency(us), 960
[CLEANUP], MaxLatency(us), 960
[CLEANUP], 95thPercentileLatency(us), 960
[CLEANUP], 99thPercentileLatency(us), 960
[UPDATE], Operations, 50132
[UPDATE], AverageLatency(us), 240.11553498763266
[UPDATE], MinLatency(us), 141
[UPDATE], MaxLatency(us), 13335
[UPDATE], 95thPercentileLatency(us), 392
[UPDATE], 99thPercentileLatency(us), 550
[UPDATE], Return=OK, 50132
[OVERALL], RunTime(ms), 22851
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4376.176097326156
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 32
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.140037635114437
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 32
[TOTAL_GC_TIME_%], Time(%), 0.140037635114437
[READ], Operations, 100000
[READ], AverageLatency(us), 104.99936
[READ], MinLatency(us), 67
[READ], MaxLatency(us), 32895
[READ], 95thPercentileLatency(us), 136
[READ], 99thPercentileLatency(us), 178
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50082
[READ-MODIFY-WRITE], AverageLatency(us), 346.96411884509405
[READ-MODIFY-WRITE], MinLatency(us), 206
[READ-MODIFY-WRITE], MaxLatency(us), 13823
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 515
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 683
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 849.0
[CLEANUP], MinLatency(us), 849
[CLEANUP], MaxLatency(us), 849
[CLEANUP], 95thPercentileLatency(us), 849
[CLEANUP], 99thPercentileLatency(us), 849
[UPDATE], Operations, 50082
[UPDATE], AverageLatency(us), 241.27029671339005
[UPDATE], MinLatency(us), 137
[UPDATE], MaxLatency(us), 13127
[UPDATE], 95thPercentileLatency(us), 393
[UPDATE], 99thPercentileLatency(us), 549
[UPDATE], Return=OK, 50082
[OVERALL], RunTime(ms), 22932
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4360.7186464329325
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 10
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.043607186464329324
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 10
[TOTAL_GC_TIME_%], Time(%), 0.043607186464329324
[READ], Operations, 100000
[READ], AverageLatency(us), 106.67405
[READ], MinLatency(us), 70
[READ], MaxLatency(us), 221183
[READ], 95thPercentileLatency(us), 134
[READ], 99thPercentileLatency(us), 170
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49922
[READ-MODIFY-WRITE], AverageLatency(us), 348.65143624053525
[READ-MODIFY-WRITE], MinLatency(us), 223
[READ-MODIFY-WRITE], MaxLatency(us), 221951
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 516
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 699
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 819.0
[CLEANUP], MinLatency(us), 819
[CLEANUP], MaxLatency(us), 819
[CLEANUP], 95thPercentileLatency(us), 819
[CLEANUP], 99thPercentileLatency(us), 819
[UPDATE], Operations, 49922
[UPDATE], AverageLatency(us), 240.10915027442812
[UPDATE], MinLatency(us), 145
[UPDATE], MaxLatency(us), 13255
[UPDATE], 95thPercentileLatency(us), 393
[UPDATE], 99thPercentileLatency(us), 560
[UPDATE], Return=OK, 49922
[OVERALL], RunTime(ms), 23160
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4317.789291882556
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 27
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.116580310880829
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 27
[TOTAL_GC_TIME_%], Time(%), 0.116580310880829
[READ], Operations, 100000
[READ], AverageLatency(us), 105.28396
[READ], MinLatency(us), 69
[READ], MaxLatency(us), 27551
[READ], 95thPercentileLatency(us), 137
[READ], 99thPercentileLatency(us), 173
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50021
[READ-MODIFY-WRITE], AverageLatency(us), 353.34287599208335
[READ-MODIFY-WRITE], MinLatency(us), 216
[READ-MODIFY-WRITE], MaxLatency(us), 14559
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 522
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 711
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 989.0
[CLEANUP], MinLatency(us), 989
[CLEANUP], MaxLatency(us), 989
[CLEANUP], 95thPercentileLatency(us), 989
[CLEANUP], 99thPercentileLatency(us), 989
[UPDATE], Operations, 50021
[UPDATE], AverageLatency(us), 246.8583394974111
[UPDATE], MinLatency(us), 137
[UPDATE], MaxLatency(us), 13207
[UPDATE], 95thPercentileLatency(us), 398
[UPDATE], 99thPercentileLatency(us), 574
[UPDATE], Return=OK, 50021
[OVERALL], RunTime(ms), 23156
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4318.535152876145
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 8
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.03454828122300915
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 8
[TOTAL_GC_TIME_%], Time(%), 0.03454828122300915
[READ], Operations, 100000
[READ], AverageLatency(us), 108.69373
[READ], MinLatency(us), 71
[READ], MaxLatency(us), 232319
[READ], 95thPercentileLatency(us), 135
[READ], 99thPercentileLatency(us), 174
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49891
[READ-MODIFY-WRITE], AverageLatency(us), 351.80986550680484
[READ-MODIFY-WRITE], MinLatency(us), 228
[READ-MODIFY-WRITE], MaxLatency(us), 234367
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 508
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 691
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 765.0
[CLEANUP], MinLatency(us), 765
[CLEANUP], MaxLatency(us), 765
[CLEANUP], 95thPercentileLatency(us), 765
[CLEANUP], 99thPercentileLatency(us), 765
[UPDATE], Operations, 49891
[UPDATE], AverageLatency(us), 241.13920346355053
[UPDATE], MinLatency(us), 149
[UPDATE], MaxLatency(us), 13223
[UPDATE], 95thPercentileLatency(us), 387
[UPDATE], 99thPercentileLatency(us), 552
[UPDATE], Return=OK, 49891
[OVERALL], RunTime(ms), 23531
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4249.713144362756
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 13
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.055246270876715825
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 13
[TOTAL_GC_TIME_%], Time(%), 0.055246270876715825
[READ], Operations, 100000
[READ], AverageLatency(us), 108.07251
[READ], MinLatency(us), 73
[READ], MaxLatency(us), 13087
[READ], 95thPercentileLatency(us), 139
[READ], 99thPercentileLatency(us), 176
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50149
[READ-MODIFY-WRITE], AverageLatency(us), 358.2740034696604
[READ-MODIFY-WRITE], MinLatency(us), 233
[READ-MODIFY-WRITE], MaxLatency(us), 14711
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 530
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 712
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 708.0
[CLEANUP], MinLatency(us), 708
[CLEANUP], MaxLatency(us), 708
[CLEANUP], 95thPercentileLatency(us), 708
[CLEANUP], 99thPercentileLatency(us), 708
[UPDATE], Operations, 50149
[UPDATE], AverageLatency(us), 248.58352110710084
[UPDATE], MinLatency(us), 150
[UPDATE], MaxLatency(us), 14127
[UPDATE], 95thPercentileLatency(us), 404
[UPDATE], 99thPercentileLatency(us), 572
[UPDATE], Return=OK, 50149
[OVERALL], RunTime(ms), 23784
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 4204.507231752438
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 14
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.05886310124453414
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 14
[TOTAL_GC_TIME_%], Time(%), 0.05886310124453414
[READ], Operations, 100000
[READ], AverageLatency(us), 110.35479
[READ], MinLatency(us), 72
[READ], MaxLatency(us), 101055
[READ], 95thPercentileLatency(us), 141
[READ], 99thPercentileLatency(us), 179
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49695
[READ-MODIFY-WRITE], AverageLatency(us), 364.36092162189357
[READ-MODIFY-WRITE], MinLatency(us), 232
[READ-MODIFY-WRITE], MaxLatency(us), 102463
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 537
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 717
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 664.0
[CLEANUP], MinLatency(us), 664
[CLEANUP], MaxLatency(us), 664
[CLEANUP], 95thPercentileLatency(us), 664
[CLEANUP], 99thPercentileLatency(us), 664
[UPDATE], Operations, 49695
[UPDATE], AverageLatency(us), 251.41581648053125
[UPDATE], MinLatency(us), 151
[UPDATE], MaxLatency(us), 15087
[UPDATE], 95thPercentileLatency(us), 407
[UPDATE], 99thPercentileLatency(us), 576
[UPDATE], Return=OK, 49695